stuianna/globLib/STM32F103CB/lib/stm32f103cb_usart.c
	}

	return error;
}

mcu_error usart2_set_data(usart_data data){

	uint8_t error = E_USART_NOERROR;

	switch(data){

		case USART_DATA_EIGHT:

            usart_set_databits(USART2,8);
			break;

		case USART_DATA_NINE:

            usart_set_databits(USART2,9);
			break;

		default:
			error = E_USART_NODATA;

			if(MCU_debugIsEnabled()){
				MCU_printError(E_USART_NODATA);
			}
			break;

	}

	return error;
}

mcu_error usart3_set_data(usart_data data){

	uint8_t error = E_USART_NOERROR;

	switch(data){

		case USART_DATA_EIGHT:

            usart_set_databits(USART3,8);
			break;

		case USART_DATA_NINE:

            usart_set_databits(USART3,9);
			break;

		default:
			error = E_USART_NODATA;

			if(MCU_debugIsEnabled()){
				MCU_printError(E_USART_NODATA);
			}
			break;

	}

	return error;
}
/****************************************************************************/
//			     PARITY FUNCTIONS
/****************************************************************************/

mcu_error USART_setParity(usart_periph peripheral, usart_parity parity){

	uint8_t error = E_USART_NOERROR;

	switch(peripheral){

		case USART_1:

			usart1_set_parity(parity);
			break;
            
		case USART_2:

			usart2_set_parity(parity);
			break;
            
		case USART_3:

			usart3_set_parity(parity);
			break;

		default:
			error =  E_USART_NOPORT;

			if(MCU_debugIsEnabled()){
				MCU_printError(E_USART_NOPORT);
			}
			break;
	}
	
	return error;
}

mcu_error usart1_set_parity(usart_parity parity){
	
	uint8_t error = E_USART_NOERROR;
		

	switch(parity){

		case USART_EVEN:

            usart_set_databits(USART1,USART_PARITY_EVEN);
			break;

		case USART_ODD:

            usart_set_databits(USART1,USART_PARITY_ODD);
			break;

		case USART_NONE:

            usart_set_databits(USART1,USART_PARITY_NONE);
			break;

		default:
			error = E_USART_NOPARITY;

			if(MCU_debugIsEnabled()){
				MCU_printError(E_USART_NOPARITY);
			}
			break;
	}

	return error;
}

mcu_error usart2_set_parity(usart_parity parity){
	
	uint8_t error = E_USART_NOERROR;
		

	switch(parity){

		case USART_EVEN:

            usart_set_databits(USART2,USART_PARITY_EVEN);
			break;

		case USART_ODD:

            usart_set_databits(USART2,USART_PARITY_ODD);
			break;

		case USART_NONE:

            usart_set_databits(USART2,USART_PARITY_NONE);
			break;

		default:
			error = E_USART_NOPARITY;

			if(MCU_debugIsEnabled()){
				MCU_printError(E_USART_NOPARITY);
			}
			break;
	}

	return error;
}

mcu_error usart3_set_parity(usart_parity parity){
	
	uint8_t error = E_USART_NOERROR;
		

	switch(parity){

		case USART_EVEN:

            usart_set_databits(USART3,USART_PARITY_EVEN);
			break;

		case USART_ODD:

            usart_set_databits(USART3,USART_PARITY_ODD);
			break;

		case USART_NONE:

            usart_set_databits(USART3,USART_PARITY_NONE);
			break;

		default:
			error = E_USART_NOPARITY;

			if(MCU_debugIsEnabled()){
				MCU_printError(E_USART_NOPARITY);
			}
			break;
	}

	return error;
}

/****************************************************************************/
//			INPUT / OUTPUT FUNCTIONS
/****************************************************************************/

mcu_error USART_put(usart_periph peripheral, uint8_t byte){

	uint8_t error = E_USART_NOERROR;

	switch(peripheral){

		case USART_1:

			usart1_put(byte);
			break;

		case USART_2:

			usart2_put(byte);
			break;

		case USART_3:

			usart3_put(byte);
			break;

		default:
			error =  E_USART_NOPORT;

			if(MCU_debugIsEnabled()){
				MCU_printError(E_USART_NOPORT);
			}
			break;
	}

    return error;

}

v_fp_u8 USART_add_put(usart_periph peripheral){


	switch(peripheral){

		case USART_1:

			return &usart1_put;
			break;

		case USART_2:

			return &usart2_put;
			break;

		case USART_3:

			return &usart3_put;
			break;

		default:

			if(MCU_debugIsEnabled()){
				MCU_printError(E_USART_NOPORT);
			}
            return NULL;
			break;
	}

}

uint8_t USART_get(usart_periph peripheral){

    uint8_t rec;

	switch(peripheral){

		case USART_1:

			rec = usart1_get();
			break;

		case USART_2:

			rec = usart2_get();
			break;

		case USART_3:

			rec = usart3_get();
			break;

		default:

			if(MCU_debugIsEnabled()){
				MCU_printError(E_USART_NOPORT);
			}

			return E_USART_NOPORT;
			break;
	}

    return rec;

}

void usart1_put(uint8_t byte){

	//Wait for a the buffer to be empty to stop lost transmission bytes
	while(!(USART_SR(USART1) & USART_SR_TXE));

	USART_DR(USART1) = byte;

}

void usart2_put(uint8_t byte){

	//Wait for a the buffer to be empty to stop lost transmission bytes
	while(!(USART_SR(USART2) & USART_SR_TXE));

	USART_DR(USART2) = byte;

}

void usart3_put(uint8_t byte){

	//Wait for a the buffer to be empty to stop lost transmission bytes
	while(!(USART_SR(USART3) & USART_SR_TXE));

	USART_DR(USART3) = byte;

}

uint8_t usart1_get(void){

	//Wait for a character to be available to read
	while(!(USART_SR(USART1) & USART_SR_RXNE));

	return USART_DR(USART1);

}

uint8_t usart2_get(void){

	//Wait for a character to be available to read
	while(!(USART_SR(USART2) & USART_SR_RXNE));

	return USART_DR(USART2);

}

uint8_t usart3_get(void){

	//Wait for a character to be available to read
	while(!(USART_SR(USART3) & USART_SR_RXNE));

	return USART_DR(USART3);

}
/****************************************************************************/
//		         TX/RX ISR REDIRECT FUNCTIONS
/****************************************************************************/

mcu_error USART_setRxISR (usart_periph peripheral, void (*new_handler)(uint8_t received)){

	uint8_t error = E_USART_NOERROR;

	switch(peripheral){

		case USART_1:

			usart1_isr_rx = new_handler;
			break;

		case USART_2:

			usart2_isr_rx = new_handler;
			break;
            
		case USART_3:

			usart3_isr_rx = new_handler;
			break;

		default:
			error =  E_USART_NOPORT;

			if(MCU_debugIsEnabled()){
				MCU_printError(E_USART_NOPORT);
			}
			break;
	}
	return error;
}

mcu_error USART_setTxISR (usart_periph peripheral, void (*new_handler)(void)){

	uint8_t error = E_USART_NOERROR;

	switch(peripheral){

		case USART_1:

			usart1_isr_tx = new_handler;
			break;

		case USART_2:

